---
kind: property
id: P:Autodesk.Revit.DB.Architecture.PostPattern.CornerPostCondition
source: html/d4b30789-9e51-4dfb-2e7f-b55c43d905a2.htm
---
# Autodesk.Revit.DB.Architecture.PostPattern.CornerPostCondition Property

The condition which controls the insertion of corner posts.

## Syntax (C#)
```csharp
public BreakCornerCondition CornerPostCondition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration